---
kind: type
id: T:Autodesk.Revit.UI.ComboBoxMember
source: html/3677ac9c-03e3-caee-d3eb-60f36856180a.htm
---
# Autodesk.Revit.UI.ComboBoxMember

This class represents an item in the drop-down list of a ComboBox.

## Syntax (C#)
```csharp
public class ComboBoxMember : RibbonItem
```

## Remarks
Note that a ComboBoxMember will not show an individual tool tip.
Use of this class is not supported in Revit Macros.